apku04/stm32_saturn/firmware/src/system/terminal.c
/*
 * terminal.c — USB command parser and menu interface
 * Ported from PIC24 — replaced sprintf with snprintf, removed PIC24-specifics
 */

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdlib.h>
#include "terminal.h"
#include "stm32u0.h"
#include "radio.h"
#include "timer.h"
#include "hal.h"
#include "maclayer.h"
#include "networklayer.h"
#include "flash_config.h"
#include "packetBuffer.h"
#include "adc.h"
#include "ina219.h"
#include "i2c.h"
#include "flash_ota.h"
#include "gps.h"

uint8_t sniffer = 0;

#define MAX_ARGV 128

static uint16_t parseArgs(uint8_t *str, uint8_t *argv[]);
static void help_command(void);
static void get_commands(uint16_t argc, uint8_t *argv[]);
static void send_commands(uint16_t argc, uint8_t *argv[]);
static uint8_t set_commands(uint16_t argc, uint8_t *argv[]);
static void ping_commands(void);
static void menu(uint16_t argc, uint8_t *argv[]);
static void set_frequency(uint32_t freq);
static void set_data_rate(uint8_t data_rate);
static void set_tx_power(uint8_t power);
static void set_macAddr(uint8_t mac_addr);
static void softwareReset(void);
static void jump_to_bootloader(void);

static deviceData_t flash_data;
static ulme Ulme;

static uint8_t beacon_flag_val = 1;
void send_beacon_flag(uint8_t flag) { beacon_flag_val = flag; }
uint8_t get_beacon_flag(void) { return beacon_flag_val; }

void terminal(uint8_t *msg, uint8_t size) {
    uint8_t cmdStr[MAX_ARGV];
    uint8_t *argv[MAX_ARGV];
    uint16_t argc;

    if (size >= MAX_ARGV) size = MAX_ARGV - 1;
    memcpy(cmdStr, msg, size);
    cmdStr[size] = '\0';
    argc = parseArgs(cmdStr, argv);
    menu(argc, argv);
}

void user_layer_init(PacketBuffer *pTxBuf) {
    Ulme.pktTxBuf = pTxBuf;
}

static uint16_t parseArgs(uint8_t *str, uint8_t *argv[]) {
    uint16_t argc = 0;
    uint8_t *ch = str;

    if (*ch == '\r' || *ch == '\n' || *ch == '\0') return 0;
    while (*ch == ' ') ch++;

    argv[argc++] = ch;
    while (*ch != ' ' && *ch != '\0' && *ch != '\r' && *ch != '\n') ch++;
    if (*ch == ' ' || *ch == '\r' || *ch == '\n') {
        *ch++ = '\0';
        while (*ch == ' ') ch++;
    }

    while (*ch != '\0' && *ch != '\r' && *ch != '\n') {
        argv[argc++] = ch;
        while (*ch != ' ' && *ch != '\0' && *ch != '\r' && *ch != '\n') ch++;
        if (*ch == ' ' || *ch == '\r' || *ch == '\n') {
            *ch++ = '\0';
            while (*ch == ' ' && *ch != '\0') ch++;
        }
    }
    return argc;
}

static void menu(uint16_t argc, uint8_t *argv[]) {
    char s[200];

    if (!argc) return;

    const char *cmd = (const char *)argv[0];

    if (strcmp(cmd, "help") == 0) {
        help_command();
    } else if (strcmp(cmd, "get") == 0) {
        get_commands(argc, argv);
    } else if (strcmp(cmd, "set") == 0) {
        set_commands(argc, argv);
    } else if (strcmp(cmd, "send") == 0) {
        send_commands(argc, argv);
    } else if (strcmp(cmd, "reset") == 0) {
        softwareReset();
    } else if (strcmp(cmd, "dfu") == 0) {
        jump_to_bootloader();
    } else if (strcmp(cmd, "version") == 0) {
        print("STM32_LORA_V1\n");
    } else if (strcmp(cmd, "ping") == 0) {
        ping_commands();
    } else {
        snprintf(s, sizeof(s), "Error: unknown cmd: %s\n", argv[0]);
        print(s);
        print("Type <help> for available commands\n");
    }
}

static void help_command(void) {
    print("Commands:\n"
          "  help - This message\n"
          "  get <param>\n"
          "  set <param> <value>\n"
          "  send <message>\n"
          "  send cfg pwr <N>          remote: set tx_power (1..22)\n"
          "  send cfg sf  <N>          remote: set SF (5..12)\n"
          "  send cfg both <pwr> <sf>  remote: set both\n"
          "  ping\n"
          "  version\n"
          "  reset\n"
          "  dfu - Enter USB DFU bootloader\n"
          "Params: frequency, data_rate, tx_power, mac_address, flash, routing, battery, solar, charge\n");
}

static uint8_t set_commands(uint16_t argc, uint8_t *argv[]) {
    char s[200];

    if (argc >= 2 && strcmp((const char *)argv[1], "flash") == 0) {
        writeFlash(&flash_data);
        print("Done\n");
        return 0;
    }

    /* --- OTA commands --- */
    if (argc >= 2 && strcmp((const char *)argv[1], "ota") == 0) {
        if (argc >= 3 && strcmp((const char *)argv[2], "erase") == 0) {
            ota_err_t rc = ota_erase();
            print(rc == OTA_OK ? "OTA Erase: OK\r\n" : "OTA Erase: FAIL\r\n");
            return 0;
        }
        if (argc >= 5 && strcmp((const char *)argv[2], "write") == 0) {
            uint32_t offset = strtoul((const char *)argv[3], NULL, 16);
            const char *hex = (const char *)argv[4];
            if (strlen(hex) != 16) {
                print("OTA Write: FAIL err=-2\r\n");
                return 1;
            }
            uint8_t data[8];
            for (int i = 0; i < 8; i++) {
                char tmp[3] = { hex[i*2], hex[i*2+1], '\0' };
                data[i] = (uint8_t)strtoul(tmp, NULL, 16);
            }
            ota_err_t rc = ota_write(offset, data, 8);
            if (rc == OTA_OK) {
                print("OTA Write: OK\r\n");
            } else {
                char s[64];
                snprintf(s, sizeof(s), "OTA Write: FAIL err=%d\r\n", (int)rc);
                print(s);
            }
            return 0;
        }
        if (argc >= 4 && strcmp((const char *)argv[2], "pending") == 0) {
            uint16_t sz = (uint16_t)strtoul((const char *)argv[3], NULL, 10);
            ota_set_pending(sz);
            print("OTA Pending: SET\r\n");
            return 0;
        }
        if (argc >= 3 && strcmp((const char *)argv[2], "clear") == 0) {
            ota_clear_pending();
            print("OTA Pending: CLEARED\r\n");
            return 0;
        }
        print("Unknown OTA set command\n");
        return 1;
    }

    if (argc >= 3) {
        if (strcmp((const char *)argv[1], "frequency") == 0) {
            uint32_t freq = strtol((const char *)argv[2], NULL, 10);
            if (freq == 444000000 || freq == 868000000 || freq == 870000000) {
                set_frequency(freq);
                flash_data.radioFreq1 = (freq >> 24) & 0xFF;
                flash_data.radioFreq2 = (freq >> 16) & 0xFF;
                flash_data.radioFreq3 = (freq >> 8) & 0xFF;
                flash_data.radioFreq4 = freq & 0xFF;
            } else {
                snprintf(s, sizeof(s), "Error: frequency must be 444000000, 868000000 or 870000000\n");
                print(s);
                return 1;
            }
        } else if (strcmp((const char *)argv[1], "data_rate") == 0) {
            uint8_t dr = strtol((const char *)argv[2], NULL, 10);
            if (dr >= 5 && dr <= 12) {
                set_data_rate(dr);
                flash_data.radioDataRate = dr;
            } else {
                print("Error: data_rate must be 5-12\n");
                return 1;
            }
        } else if (strcmp((const char *)argv[1], "tx_power") == 0) {
            uint8_t pw = strtol((const char *)argv[2], NULL, 10);
            if (pw >= 1 && pw <= 22) {
                set_tx_power(pw);
                flash_data.radioTxPwr = pw;
            } else {
                print("Error: tx_power must be 1-22\n");
                return 1;
            }
        } else if (strcmp((const char *)argv[1], "mac_address") == 0) {
            uint8_t addr = strtol((const char *)argv[2], NULL, 10);
            set_macAddr(addr);
            flash_data.deviceID = addr;
        } else if (strcmp((const char *)argv[1], "beacon") == 0) {
            uint8_t b = strtol((const char *)argv[2], NULL, 10);
            if (b == 0 || b == 1) send_beacon_flag(b);
            print("Done\n");
        } else {
            print("Unknown parameter\n");
        }
    } else {
        print("Insufficient arguments\n");
    }
    return 0;
}

