apku04/stm32_saturn/firmware/src/system/terminal.c
static void get_commands(uint16_t argc, uint8_t *argv[]) {
    char buf[128];

    if (argc <= 1) return;

    if (strcmp((const char *)argv[1], "frequency") == 0) {
        uint32_t freq = radio_get_channel();
        snprintf(buf, sizeof(buf), "Frequency: %lu Hz\n", (unsigned long)freq);
        print(buf);
    } else if (strcmp((const char *)argv[1], "data_rate") == 0) {
        snprintf(buf, sizeof(buf), "Data Rate: %u\n", radio_get_datarate());
        print(buf);
    } else if (strcmp((const char *)argv[1], "tx_power") == 0) {
        snprintf(buf, sizeof(buf), "TX Power: %u\n", radio_get_tx_power());
        print(buf);
    } else if (strcmp((const char *)argv[1], "mac_address") == 0) {
        snprintf(buf, sizeof(buf), "MAC Address: %u\n", get_mac_address());
        print(buf);
    } else if (strcmp((const char *)argv[1], "uid") == 0) {
        const volatile uint8_t *p = (const volatile uint8_t *)UID_BASE;
        snprintf(buf, sizeof(buf),
                 "UID: %02X%02X%02X%02X %02X%02X%02X%02X %02X%02X%02X%02X\n",
                 p[0],p[1],p[2],p[3], p[4],p[5],p[6],p[7], p[8],p[9],p[10],p[11]);
        print(buf);

    } else if (strcmp((const char *)argv[1], "flash") == 0) {
        deviceData_t fData;
        uint8_t *p = (uint8_t *)&fData;
        const uint8_t ids[] = { DEVICE_ID, RADIO_FREQ1, RADIO_FREQ2, RADIO_FREQ3,
                                RADIO_FREQ4, RADIO_DR, RADIO_TX_PWR };
        for (int i = 0; i < (int)(sizeof(ids)/sizeof(ids[0])); i++)
            readFlash(ids[i], p + i);

        uint32_t freq = ((uint32_t)fData.radioFreq1 << 24) |
                        ((uint32_t)fData.radioFreq2 << 16) |
                        ((uint32_t)fData.radioFreq3 << 8) |
                        (uint32_t)fData.radioFreq4;
        snprintf(buf, sizeof(buf),
                 "\nFlash Data\nFrequency: %lu Hz\nData Rate: %u\n"
                 "TX Power: %u\nMAC Address: %u\n",
                 (unsigned long)freq, fData.radioDataRate,
                 fData.radioTxPwr, fData.deviceID);
        print(buf);
    } else if (strcmp((const char *)argv[1], "routing") == 0) {
        print_routing_table();
    } else if (strcmp((const char *)argv[1], "gps") == 0) {
        if (argc >= 3 && strcmp((const char *)argv[2], "reinit") == 0) {
            gps_init();
            print("GPS reinitialised\n");
            return;
        }
        if (argc >= 3 && strcmp((const char *)argv[2], "raw") == 0) {
            uint8_t on = (argc >= 4) ? (uint8_t)atoi((const char *)argv[3]) : 1;
            gps_set_raw_echo(on);
            snprintf(buf, sizeof(buf), "GPS raw echo: %u\n", on);
            print(buf);
            return;
        }
        if (argc >= 3 && strcmp((const char *)argv[2], "baud") == 0 && argc >= 4) {
            uint32_t b = strtoul((const char *)argv[3], NULL, 10);
            gps_set_baud(b);
            snprintf(buf, sizeof(buf), "GPS baud: %lu\n", (unsigned long)b);
            print(buf);
            return;
        }
        if (argc >= 3 && strcmp((const char *)argv[2], "af") == 0 && argc >= 4) {
            uint8_t a = (uint8_t)atoi((const char *)argv[3]);
            gps_set_af(a);
            snprintf(buf, sizeof(buf), "GPS AF: %u\n", a);
            print(buf);
            return;
        }
        if (argc >= 3 && strcmp((const char *)argv[2], "probe") == 0) {
            uint32_t r = gps_probe_pa3();
            uint32_t trans = r & 0xFFFFu;
            uint32_t lows  = r >> 16;
            snprintf(buf, sizeof(buf),
                     "PA3 probe (~1s): transitions=%lu  low_samples=%lu (clamp 65535)\n",
                     (unsigned long)trans, (unsigned long)lows);
            print(buf);
            return;
        }
        const gps_fix_t *f = gps_get_fix();
        char nbuf[110];
        gps_get_last_nmea(nbuf, sizeof(nbuf));
        uint32_t toggles = 0;
        uint32_t isr = gps_diag(&toggles);
        snprintf(buf, sizeof(buf),
                 "GPS sentences=%lu fix=%u sats=%u "
                 "lat=%ld.%06ld lon=%ld.%06ld alt=%dm time=%06lu\n",
                 (unsigned long)f->sentences, f->fix_quality, f->sats,
                 (long)(f->lat_udeg / 1000000), (long)(f->lat_udeg < 0 ? -f->lat_udeg : f->lat_udeg) % 1000000,
                 (long)(f->lon_udeg / 1000000), (long)(f->lon_udeg < 0 ? -f->lon_udeg : f->lon_udeg) % 1000000,
                 f->alt_m, (unsigned long)f->time_hms);
        print(buf);
        snprintf(buf, sizeof(buf),
                 "GPS diag: USART2_ISR=0x%08lX PA2_lvl=%u PA3_lvl=%u (1.5s)\n",
                 (unsigned long)isr,
                 (unsigned)((toggles >> 0) & 1u),
                 (unsigned)((toggles >> 1) & 1u));
        print(buf);
        snprintf(buf, sizeof(buf),
                 "GPS pin: PA2 mod=%u af=%u pu=%u  PA3 mod=%u af=%u pu=%u\n",
                 (unsigned)((toggles >> 4)  & 3u),
                 (unsigned)((toggles >> 8)  & 0xFu),
                 (unsigned)((toggles >> 16) & 3u),
                 (unsigned)((toggles >> 6)  & 3u),
                 (unsigned)((toggles >> 12) & 0xFu),
                 (unsigned)((toggles >> 18) & 3u));
        print(buf);
        if (nbuf[0]) {
            snprintf(buf, sizeof(buf), "GPS last NMEA: %s\n", nbuf);
            print(buf);
        }
        uint32_t ic, rn, fe2;
        gps_isr_stats(&ic, &rn, &fe2);
        snprintf(buf, sizeof(buf),
                 "GPS ISR: calls=%lu rxne=%lu fe=%lu CR1=0x%08lX BRR=%lu NVIC=0x%08lX\n",
                 (unsigned long)ic, (unsigned long)rn, (unsigned long)fe2,
                 (unsigned long)gps_get_cr1(), (unsigned long)gps_get_brr(),
                 (unsigned long)gps_get_nvic());
        print(buf);
    } else if (strcmp((const char *)argv[1], "battery") == 0) {
        uint16_t raw = adc_read_battery_raw();
        uint32_t mv = ((uint32_t)raw * 6600UL) / 4096UL;
        snprintf(buf, sizeof(buf), "Battery: %lu mV (raw: %u)\n", (unsigned long)mv, raw);
        print(buf);
    } else if (strcmp((const char *)argv[1], "solar") == 0) {
        /* Full solar/charger readout from U10 INA219.
         * Shunt R = 0.05 Ω (R58, 50mΩ ±1%) → I[mA] = V_shunt[µV] / 50 */
        uint16_t bus_mv  = ina219_read_bus_mv();
        int32_t  sh_uv   = ina219_read_shunt_uv();
        int32_t  i_ma    = sh_uv / 50;
        int32_t  p_mw    = ((int32_t)bus_mv * i_ma) / 1000;
        ChargeStatus cs  = charge_get_status();
        snprintf(buf, sizeof(buf),
                 "Solar:  bus=%u mV  shunt=%ld µV  I=%ld mA  P=%ld mW  charge=%s\n",
                 bus_mv, (long)sh_uv, (long)i_ma, (long)p_mw, charge_status_str(cs));
        print(buf);
    } else if (strcmp((const char *)argv[1], "charge") == 0) {
        ChargeStatus s = charge_get_status();
        snprintf(buf, sizeof(buf), "Charge: %s\n", charge_status_str(s));
        print(buf);
    } else if (strcmp((const char *)argv[1], "vrefint") == 0) {
        /* Read 4 samples; report each + average to expose any glitch */
        uint16_t s[4];
        uint32_t sum = 0;
        for (int i = 0; i < 4; i++) { s[i] = adc_read_vrefint_raw(); sum += s[i]; }
        uint16_t avg = (uint16_t)(sum / 4);
        uint16_t vdda = adc_vdda_from_raw(avg);
        uint16_t cal = *(volatile uint16_t *)0x1FFF6E68u;
        snprintf(buf, sizeof(buf),
                 "VREFINT raws: %u %u %u %u  avg=%u  CAL=%u  VDDA=%u mV\n",
                 s[0], s[1], s[2], s[3], avg, cal, vdda);
        print(buf);
    } else if (strcmp((const char *)argv[1], "ina") == 0) {
        /* Write config register and report I2C result */
        int wret = i2c2_write_reg(0x40, 0x00, 0x399F);
        snprintf(buf, sizeof(buf), "INA219 config write: %d\n", wret);
        print(buf);
        uint16_t raw_shunt = 0, raw_bus = 0;
        int sr = i2c2_read_reg(0x40, 0x01, &raw_shunt);
        int br = i2c2_read_reg(0x40, 0x02, &raw_bus);
        snprintf(buf, sizeof(buf),
                 "shunt reg: ret=%d raw=0x%04X (%d mV)\n"
                 "bus   reg: ret=%d raw=0x%04X (%u mV)\n",
                 sr, raw_shunt, (int16_t)raw_shunt / 100,
                 br, raw_bus, (raw_bus >> 3) * 4);
        print(buf);
    } else if (strcmp((const char *)argv[1], "i2cscan") == 0) {
        print("Scanning I2C2 (0x08-0x77)...\n");
        for (uint8_t a = 0x08; a <= 0x77; a++) {
            uint8_t dummy;
            if (i2c2_read(a, &dummy, 1) == 0) {
                snprintf(buf, sizeof(buf), "  Found: 0x%02X\n", a);
                print(buf);
            }
        }
        print("Done\n");
    } else if (strcmp((const char *)argv[1], "adcscan") == 0) {
        print("ADC scan ch0-19:\n");
        for (uint8_t ch = 0; ch <= 19; ch++) {
            uint16_t raw = adc_read_channel_raw(ch);
            if (raw > 20) {
                uint32_t mv = ((uint32_t)raw * 3300UL) / 4096UL;
                snprintf(buf, sizeof(buf), "  CH%02u: raw=%4u  pin=%4lumV\n", ch, raw, (unsigned long)mv);
                print(buf);
            }
        }
        uint16_t bat = adc_read_battery_mv();
        uint16_t braw = adc_read_battery_raw();
        snprintf(buf, sizeof(buf), "bat_mv=%u (raw=%u)\n", bat, braw);
        print(buf);
    } else if (strcmp((const char *)argv[1], "ota") == 0) {
        if (argc >= 3 && strcmp((const char *)argv[2], "bank") == 0) {
            snprintf(buf, sizeof(buf), "OTA Bank: 0x%08lX size=%lu\r\n",
                     (unsigned long)ota_bank_addr(), (unsigned long)ota_bank_size());
            print(buf);
        } else if (argc >= 5 && strcmp((const char *)argv[2], "read") == 0) {
            uint32_t offset = strtoul((const char *)argv[3], NULL, 16);
            uint32_t len = strtoul((const char *)argv[4], NULL, 10);
            if (len > 16) len = 16;
            uint8_t tmp[16];
            ota_read(offset, tmp, len);
            print("OTA Read:");
            for (uint32_t i = 0; i < len; i++) {
                char hx[4];
                snprintf(hx, sizeof(hx), " %02X", tmp[i]);
                print(hx);
            }
            print("\r\n");
        } else if (argc >= 3 && strcmp((const char *)argv[2], "pending") == 0) {
            uint16_t img_sz = 0;
            if (ota_is_pending(&img_sz)) {
                snprintf(buf, sizeof(buf), "OTA Pending: YES size=%u\r\n", img_sz);
            } else {
                snprintf(buf, sizeof(buf), "OTA Pending: NO\r\n");
            }
            print(buf);
        }
    } else if (strcmp((const char *)argv[1], "i2cread") == 0 && argc >= 4) {
        /* Usage: get i2cread <addr_hex> <reg_hex>
         * Reads a 16-bit big-endian register from an arbitrary I2C device.
         * Use to prove I2C read path with a known-good device on H4. */
        uint8_t addr = (uint8_t)strtoul((const char *)argv[2], NULL, 16);
        uint8_t reg  = (uint8_t)strtoul((const char *)argv[3], NULL, 16);
        uint16_t val = 0;
        int r = i2c2_read_reg(addr, reg, &val);
        snprintf(buf, sizeof(buf),
                 "i2c read  addr=0x%02X reg=0x%02X -> ret=%d val=0x%04X\n",
                 addr, reg, r, val);
        print(buf);
    }
}

