apku04/stm32_saturn/firmware/src/system/terminal.c
static void send_commands(uint16_t argc, uint8_t *argv[]) {
    /* Range-test remote-config command:
     *   send cfg pwr <N>           -> tx_power = N (1..22)
     *   send cfg sf  <N>           -> data_rate (SF) = N (5..12)
     *   send cfg both <pwr> <sf>   -> both
     * Broadcast (TTL=0) like PING. Field device replies with CMD_ACK before
     * applying. After SF change you MUST manually `set data_rate <N>` on
     * the base or you'll stop hearing the remote. */
    if (argc >= 3 && strcmp((const char *)argv[1], "cfg") == 0) {
        Packet pkt;
        memset(&pkt, 0, sizeof(Packet));
        pkt.pOwner = NET;
        pkt.pktDir = OUTGOING;
        pkt.control_app = CMD_CFG;

        const char *sub = (const char *)argv[2];
        if (argc >= 4 && strcmp(sub, "pwr") == 0) {
            uint8_t v = (uint8_t)strtol((const char *)argv[3], NULL, 10);
            if (v < 1 || v > 22) { print("Error: pwr must be 1..22\n"); return; }
            pkt.data[0] = 0x01;
            pkt.data[1] = v;
            pkt.length = 4 + 2;
        } else if (argc >= 4 && strcmp(sub, "sf") == 0) {
            uint8_t v = (uint8_t)strtol((const char *)argv[3], NULL, 10);
            if (v < 5 || v > 12) { print("Error: sf must be 5..12\n"); return; }
            pkt.data[0] = 0x02;
            pkt.data[1] = v;
            pkt.length = 4 + 2;
        } else if (argc >= 5 && strcmp(sub, "both") == 0) {
            uint8_t p = (uint8_t)strtol((const char *)argv[3], NULL, 10);
            uint8_t s = (uint8_t)strtol((const char *)argv[4], NULL, 10);
            if (p < 1 || p > 22 || s < 5 || s > 12) {
                print("Error: usage: send cfg both <pwr 1..22> <sf 5..12>\n");
                return;
            }
            pkt.data[0] = 0x03;
            pkt.data[1] = p;
            pkt.data[2] = s;
            pkt.length = 4 + 3;
        } else {
            print("Usage: send cfg pwr <N> | send cfg sf <N> | send cfg both <pwr> <sf>\n");
            return;
        }

        if (buffer_full(Ulme.pktTxBuf) != GLOB_ERROR_BUFFER_FULL) {
            write_packet(Ulme.pktTxBuf, &pkt);
            print("[CFG] sent, awaiting CMD_ACK...\n");
        } else {
            print("Buffer full\n");
        }
        return;
    }

    Packet pkt;
    memset(&pkt, 0, sizeof(Packet));
    pkt.pOwner = APP;
    pkt.pktDir = OUTGOING;

    uint8_t *dest = pkt.data;
    uint8_t remaining = sizeof(pkt.data) - 1;

    for (uint16_t i = 1; i < argc && remaining > 0; i++) {
        if (i > 1 && remaining > 0) { *dest++ = ' '; remaining--; }
        uint8_t *src = argv[i];
        while (*src && remaining > 0) { *dest++ = *src++; remaining--; }
    }
    pkt.length = dest - pkt.data;

    if (buffer_full(Ulme.pktTxBuf) != GLOB_ERROR_BUFFER_FULL)
        write_packet(Ulme.pktTxBuf, &pkt);
    else
        print("Buffer full\n");
}

static void ping_commands(void) {
    Packet pkt;
    memset(&pkt, 0, sizeof(Packet));
    pkt.pOwner = NET;
    pkt.pktDir = OUTGOING;
    pkt.control_app = PING;
    pkt.length = 4;

    if (buffer_full(Ulme.pktTxBuf) != GLOB_ERROR_BUFFER_FULL)
        write_packet(Ulme.pktTxBuf, &pkt);
    else
        print("Buffer full\n");
}

void print_routing_table(void) {
    char buf[128];
    RoutingEntry *rt = get_routing_table();
    uint8_t n = get_routing_entries();

    snprintf(buf, sizeof(buf), "Routing table (%u entries):\n", n);
    print(buf);
    for (uint8_t i = 0; i < n; i++) {
        snprintf(buf, sizeof(buf), "  [%u] dest=%u next=%u hops=%u age=%u\n",
                 i, rt[i].destination, rt[i].next_hop, rt[i].hop_count, rt[i].age);
        print(buf);
    }
}

static void set_frequency(uint32_t freq)   { radio_set_channel(freq); print("Done\n"); }
static void set_data_rate(uint8_t dr)      { radio_set_datarate(dr); print("Done\n"); }
static void set_tx_power(uint8_t pw)       { radio_set_tx_power(pw); print("Done\n"); }
static void set_macAddr(uint8_t addr) {
    if (set_mac_address(addr)) print("Error\n"); else print("Done\n");
}
static void softwareReset(void) {
    SCB_AIRCR = 0x05FA0004;  /* SYSRESETREQ */
    while (1);
}

#include "usb_cdc.h"

#define SYSTEM_MEMORY_ADDR  0x1FFF0000

static void jump_to_bootloader(void) {
    typedef void (*pFunction)(void);

    print("Entering DFU bootloader...\n");

    /* Give USB time to send the response */
    for (volatile int i = 0; i < 200000; i++);

    /* Disable USB pull-up so host sees disconnect */
    USB_BCDR &= ~USB_BCDR_DPPU;
    USB_CNTR = 0x0003;  /* FRES + PDWN — power down USB */

    /* Disable SysTick */
    SYST_CSR = 0;

    /* Disable all NVIC interrupts */
    NVIC_ICER = 0xFFFFFFFF;

    /* Clear any pending interrupts */
    NVIC_ISPR = 0;       /* write has no effect on pending; use ICPR */
    (*(volatile uint32_t *)0xE000E280) = 0xFFFFFFFF;  /* NVIC_ICPR */

    /* Enable SYSCFG clock and remap system memory to 0x00000000 */
    RCC_APBENR2 |= (1 << 0);  /* SYSCFGEN */
    SYSCFG_CFGR1 = (SYSCFG_CFGR1 & ~0x3) | 0x1;  /* MEM_MODE = 01 (system memory) */

    __asm volatile ("dsb");
    __asm volatile ("isb");

    /* Read reset vector from system memory */
    uint32_t bootloader_sp   = *(volatile uint32_t *)(SYSTEM_MEMORY_ADDR + 0);
    uint32_t bootloader_addr = *(volatile uint32_t *)(SYSTEM_MEMORY_ADDR + 4);

    /* Set main stack pointer and jump */
    __asm volatile ("msr msp, %0" :: "r" (bootloader_sp));
    ((pFunction)bootloader_addr)();

    while (1);
}
